resources/schemas/RPC/Schemas/wsdl/NHS111-v3.2-flat.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="NHS111" targetNamespace="urn:nhs-itk:ns:201005" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:i0="urn:nhs-itk:services:201005" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="urn:nhs-itk:ns:201005" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsp:Policy wsu:Id="SendNHS111Report-v2-0_pttBinding_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="true"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding><wsaw:UsingAddressing/></wsp:All></wsp:ExactlyOne></wsp:Policy><wsp:Policy wsu:Id="NHS111RepeatCallerSyncQueryResp-v1-0_pttBinding_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="true"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding><wsaw:UsingAddressing/></wsp:All></wsp:ExactlyOne></wsp:Policy><wsp:Policy wsu:Id="RequestAmbulanceDispatch-v2-0_pttBinding_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="true"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding><wsaw:UsingAddressing/></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="urn:nhs-itk:ns:201005" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:element name="DistributionEnvelope" type="tns:distributionEnvelopeType"/><xs:complexType name="distributionEnvelopeType"><xs:sequence><xs:element minOccurs="0" maxOccurs="1" name="header" type="tns:distributionHeaderType"/><xs:element minOccurs="0" maxOccurs="1" name="payloads" type="tns:payloadsType"/></xs:sequence></xs:complexType><xs:complexType name="distributionHeaderType"><xs:sequence><xs:element minOccurs="0" maxOccurs="1" name="addresslist" type="tns:addressListType"/><xs:element minOccurs="0" maxOccurs="1" name="auditIdentity" type="tns:auditIdentityType"/><xs:element minOccurs="0" maxOccurs="1" name="manifest" type="tns:ManifestType"/><xs:element minOccurs="0" maxOccurs="1" name="senderAddress" type="tns:addressType"/><xs:element minOccurs="0" maxOccurs="1" name="handlingSpecification" type="tns:handlingType"/></xs:sequence><xs:attribute name="trackingid" type="xs:string"/><xs:attribute name="service" type="xs:anyURI"/></xs:complexType><xs:complexType name="addressListType"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="address" type="tns:addressType"/></xs:sequence></xs:complexType><xs:complexType name="addressType"><xs:attribute default="2.16.840.1.113883.2.1.3.2.4.18.22" name="type" type="xs:string"/><xs:attribute name="uri" type="xs:anyURI"/></xs:complexType><xs:complexType name="auditIdentityType"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="id" type="tns:IdentityType"/></xs:sequence></xs:complexType><xs:complexType name="IdentityType"><xs:attribute default="2.16.840.1.113883.2.1.3.2.4.18.27" name="type" type="xs:string"/><xs:attribute name="uri" type="xs:anyURI"/></xs:complexType><xs:complexType name="ManifestType"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="manifestitem" type="tns:ManifestItemType"/></xs:sequence><xs:attribute name="count" type="xs:integer"/></xs:complexType><xs:complexType name="ManifestItemType"><xs:attribute name="id" type="xs:IDREF"/><xs:attribute name="mimetype" type="xs:string"/><xs:attribute name="profileid" type="xs:anyURI"/><xs:attribute default="false" name="metadata" type="xs:boolean"/><xs:attribute default="false" name="compressed" type="xs:boolean"/><xs:attribute default="false" name="base64" type="xs:boolean"/><xs:attribute default="false" name="encrypted" type="xs:boolean"/><xs:anyAttribute/></xs:complexType><xs:complexType name="handlingType"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="spec" type="tns:handlingSpecType"/></xs:sequence></xs:complexType><xs:complexType name="handlingSpecType"><xs:attribute name="key" type="xs:anyURI"/><xs:attribute name="value" type="xs:string"/></xs:complexType><xs:complexType name="payloadsType"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="payload" type="tns:payloadType"/></xs:sequence><xs:attribute name="count" type="xs:integer"/></xs:complexType><xs:complexType name="payloadType"><xs:sequence><xs:any minOccurs="0" maxOccurs="unbounded" namespace="##any"/></xs:sequence><xs:attribute name="id" type="xs:ID"/><xs:attribute name="filename" type="xs:string"/></xs:complexType><xs:element name="SimpleMessageResponse" type="xs:string"/><xs:element name="ToolkitErrorInfo" type="tns:ToolkitErrorInfoStruct"/><xs:complexType name="ToolkitErrorInfoStruct"><xs:sequence><xs:element minOccurs="0" maxOccurs="1" name="ErrorID" type="xs:string"/><xs:element minOccurs="0" maxOccurs="1" name="ErrorCode"><xs:complexType><xs:simpleContent><xs:extension base="xs:string"><xs:attribute default="2.16.840.1.113883.2.1.3.2.4.17.268" name="codeSystem" type="xs:string"/></xs:extension></xs:simpleContent></xs:complexType></xs:element><xs:element minOccurs="0" maxOccurs="1" name="ErrorText" type="xs:string"/><xs:element minOccurs="0" maxOccurs="1" name="ErrorDiagnosticText" type="xs:string"/><xs:any minOccurs="0" maxOccurs="1"/></xs:sequence></xs:complexType></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://www.w3.org/2005/08/addressing" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.w3.org/2005/08/addressing"><xs:element name="MessageID" type="xs:string"/></xs:schema></wsdl:types><wsdl:message name="SendNHS111Reportv20Request"><wsdl:part name="SendNHS111Report-v2-0" element="tns:DistributionEnvelope"/></wsdl:message><wsdl:message name="AcknowledgementResponse"><wsdl:part name="acknowledgementResponse" element="tns:SimpleMessageResponse"/></wsdl:message><wsdl:message name="AcknowledgementResponse_Headers"><wsdl:part name="MessageID" element="wsa10:MessageID"/></wsdl:message><wsdl:message name="SendNHS111Report-v2-0_ptt_SendNHS111Report-v2-0_ToolkitErrorInfo_FaultMessage"><wsdl:part name="detail" element="tns:ToolkitErrorInfo"/></wsdl:message><wsdl:message name="NHS111RepeatCallerSyncQueryRespv10Request"><wsdl:part name="NHS111RepeatCallerQuery-v1-0" element="tns:DistributionEnvelope"/></wsdl:message><wsdl:message name="NHS111RepeatCallerSyncQueryRespv10Response"><wsdl:part name="NHS111RepeatCallerResponse-v1-0" element="tns:DistributionEnvelope"/></wsdl:message><wsdl:message name="NHS111RepeatCallerSyncQueryRespv10Response_Headers"><wsdl:part name="MessageID" element="wsa10:MessageID"/></wsdl:message><wsdl:message name="NHS111RepeatCallerSyncQueryResp-v1-0_ptt_NHS111RepeatCallerSyncQueryResp-v1-0_ToolkitErrorInfo_FaultMessage"><wsdl:part name="detail" element="tns:ToolkitErrorInfo"/></wsdl:message><wsdl:message name="RequestAmbulanceDispatchv20Request"><wsdl:part name="RequestAmbulanceDispatch-v2-0" element="tns:DistributionEnvelope"/></wsdl:message><wsdl:message name="RequestAmbulanceDispatch-v2-0_ptt_RequestAmbulanceDispatch-v2-0_ToolkitErrorInfo_FaultMessage"><wsdl:part name="detail" element="tns:ToolkitErrorInfo"/></wsdl:message><wsdl:portType name="SendNHS111Report-v2-0_ptt"><wsdl:operation name="SendNHS111Report-v2-0"><wsdl:input wsaw:Action="urn:nhs-itk:services:201005:SendNHS111Report-v2-0" name="SendNHS111Reportv20Request" message="tns:SendNHS111Reportv20Request"/><wsdl:output wsaw:Action="urn:nhs-itk:services:201005:SendNHS111Report-v2-0Response" name="AcknowledgementResponse" message="tns:AcknowledgementResponse"/><wsdl:fault wsaw:Action="http://www.w3.org/2005/08/addressing/soap/fault" name="ToolkitErrorInfo" message="tns:SendNHS111Report-v2-0_ptt_SendNHS111Report-v2-0_ToolkitErrorInfo_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:portType name="NHS111RepeatCallerSyncQueryResp-v1-0_ptt"><wsdl:operation name="NHS111RepeatCallerSyncQueryResp-v1-0"><wsdl:input wsaw:Action="urn:nhs-itk:services:201005:NHS111RepeatCallerSyncQueryResp-v1-0" name="NHS111RepeatCallerSyncQueryRespv10Request" message="tns:NHS111RepeatCallerSyncQueryRespv10Request"/><wsdl:output wsaw:Action="urn:nhs-itk:services:201005:NHS111RepeatCallerSyncQueryResp-v1-0Response" name="NHS111RepeatCallerSyncQueryRespv10Response" message="tns:NHS111RepeatCallerSyncQueryRespv10Response"/><wsdl:fault wsaw:Action="http://www.w3.org/2005/08/addressing/soap/fault" name="ToolkitErrorInfo" message="tns:NHS111RepeatCallerSyncQueryResp-v1-0_ptt_NHS111RepeatCallerSyncQueryResp-v1-0_ToolkitErrorInfo_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:portType name="RequestAmbulanceDispatch-v2-0_ptt"><wsdl:operation name="RequestAmbulanceDispatch-v2-0"><wsdl:input wsaw:Action="urn:nhs-itk:services:201005:RequestAmbulanceDispatch-v2-0" name="RequestAmbulanceDispatchv20Request" message="tns:RequestAmbulanceDispatchv20Request"/><wsdl:output wsaw:Action="urn:nhs-itk:ns:201005/RequestAmbulanceDispatch-v2-0_ptt/RequestAmbulanceDispatch-v2-0Response" name="AcknowledgementResponse" message="tns:AcknowledgementResponse"/><wsdl:fault wsaw:Action="http://www.w3.org/2005/08/addressing/soap/fault" name="ToolkitErrorInfo" message="tns:RequestAmbulanceDispatch-v2-0_ptt_RequestAmbulanceDispatch-v2-0_ToolkitErrorInfo_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="SendNHS111Report-v2-0_pttBinding" type="tns:SendNHS111Report-v2-0_ptt"><wsp:PolicyReference URI="#SendNHS111Report-v2-0_pttBinding_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="SendNHS111Report-v2-0"><soap:operation soapAction="urn:nhs-itk:services:201005:SendNHS111Report-v2-0" style="document"/><wsdl:input name="SendNHS111Reportv20Request"><soap:body use="literal"/></wsdl:input><wsdl:output name="AcknowledgementResponse"><soap:header message="tns:AcknowledgementResponse_Headers" part="MessageID" use="literal"/><soap:body use="literal"/></wsdl:output><wsdl:fault name="ToolkitErrorInfo"><soap:fault use="literal" name="ToolkitErrorInfo" namespace=""/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:binding name="NHS111RepeatCallerSyncQueryResp-v1-0_pttBinding" type="tns:NHS111RepeatCallerSyncQueryResp-v1-0_ptt"><wsp:PolicyReference URI="#NHS111RepeatCallerSyncQueryResp-v1-0_pttBinding_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="NHS111RepeatCallerSyncQueryResp-v1-0"><soap:operation soapAction="urn:nhs-itk:services:201005:NHS111RepeatCallerSyncQueryResp-v1-0" style="document"/><wsdl:input name="NHS111RepeatCallerSyncQueryRespv10Request"><soap:body use="literal"/></wsdl:input><wsdl:output name="NHS111RepeatCallerSyncQueryRespv10Response"><soap:header message="tns:NHS111RepeatCallerSyncQueryRespv10Response_Headers" part="MessageID" use="literal"/><soap:body use="literal"/></wsdl:output><wsdl:fault name="ToolkitErrorInfo"><soap:fault use="literal" name="ToolkitErrorInfo" namespace=""/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:binding name="RequestAmbulanceDispatch-v2-0_pttBinding" type="tns:RequestAmbulanceDispatch-v2-0_ptt"><wsp:PolicyReference URI="#RequestAmbulanceDispatch-v2-0_pttBinding_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="RequestAmbulanceDispatch-v2-0"><soap:operation soapAction="urn:nhs-itk:services:201005:RequestAmbulanceDispatch-v2-0" style="document"/><wsdl:input name="RequestAmbulanceDispatchv20Request"><soap:body use="literal"/></wsdl:input><wsdl:output name="AcknowledgementResponse"><soap:header message="tns:AcknowledgementResponse_Headers" part="MessageID" use="literal"/><soap:body use="literal"/></wsdl:output><wsdl:fault name="ToolkitErrorInfo"><soap:fault use="literal" name="ToolkitErrorInfo" namespace=""/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:service name="NHS111"><wsdl:port name="SendNHS111Report-v2-0_pttPort" binding="tns:SendNHS111Report-v2-0_pttBinding"><soap:address location="https://test-09.oneoneone.nhs.uk:1880/v2-2-1/RepeatCallers.svc"/><wsa10:EndpointReference><wsa10:Address>https://test-09.oneoneone.nhs.uk:1880/v2-2-1/RepeatCallers.svc</wsa10:Address></wsa10:EndpointReference></wsdl:port><wsdl:port name="NHS111RepeatCallerSyncQueryResp_pttPort" binding="tns:NHS111RepeatCallerSyncQueryResp-v1-0_pttBinding"><soap:address location="https://test-09.oneoneone.nhs.uk:1880/v2-2-1/RepeatCallers.svc"/><wsa10:EndpointReference><wsa10:Address>https://test-09.oneoneone.nhs.uk:1880/v2-2-1/RepeatCallers.svc</wsa10:Address></wsa10:EndpointReference></wsdl:port><wsdl:port name="RequestAmbulanceDispatch-v2-0_pttPort" binding="tns:RequestAmbulanceDispatch-v2-0_pttBinding"><soap:address location="https://test-09.oneoneone.nhs.uk:1880/v2-2-1/RepeatCallers.svc"/><wsa10:EndpointReference><wsa10:Address>https://test-09.oneoneone.nhs.uk:1880/v2-2-1/RepeatCallers.svc</wsa10:Address></wsa10:EndpointReference></wsdl:port></wsdl:service></wsdl:definitions>