BlackPear/test cases/smsp.getPatientDetails.match when using sparse parameters.res.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:hl7="urn:hl7-org:v3" xmlns:itk="urn:nhs-itk:ns:201005" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header>
        <wsa:MessageID>DFD08B6E-5DBD-11E8-92FD-6C3BE5A861CE</wsa:MessageID>
        <wsa:Action>urn:nhs-itk:services:201005:getPatientDetails-v1-0Response</wsa:Action>
    </soap:Header>
    <soap:Body>
        <itk:DistributionEnvelope>
            <itk:header service="urn:nhs-itk:services:201005:getPatientDetails-v1-0Response" trackingid="DFD08F24-5DBD-11E8-92FD-6C3BE5A861CE">
                <itk:manifest count="1">
                    <itk:manifestitem base64="false" compressed="false" encrypted="false" id="uuid_DFC13434-5DBD-11E8-92FD-6C3BE5A861CE" mimetype="text/xml" profileid="urn:nhs-en:profile:getPatientDetailsResponse-v1-0"/>
                </itk:manifest>
            </itk:header>
            <itk:payloads count="1">
                <itk:payload id="uuid_DFC13434-5DBD-11E8-92FD-6C3BE5A861CE">
                    <getPatientDetailsResponse-v1-0 classCode="OBS" moodCode="EVN" xmlns="urn:hl7-org:v3">
                        <id root="DFC13434-5DBD-11E8-92FD-6C3BE5A861CE"/>
                        <code code="getPatientDetailsResponse-v1-0" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.284"/>
                        <value code="SMSP-0000" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.285"/>
                        <subject typeCode="SBJ">
                            <patient classCode="PAT">
                                <id extension="9449306680" root="2.16.840.1.113883.2.1.4.1"/>
                                <name>
                                    <prefix>MR</prefix>
                                    <given>GORE</given>
                                    <given>DEFOREST</given>
                                    <family>PHONANAN</family>
                                </name>
                                <addr use="H">
                                    <postalCode>KT21 2BE</postalCode>
                                    <streetAddressLine/>
                                    <streetAddressLine>18 WOODFIELD LANE</streetAddressLine>
                                    <streetAddressLine/>
                                    <streetAddressLine>ASHTEAD</streetAddressLine>
                                    <streetAddressLine>SURREY</streetAddressLine>
                                </addr>
                                <patientPerson classCode="PSN" determinerCode="INSTANCE">
                                    <administrativeGenderCode code="1" codeSystem="2.16.840.1.113883.2.1.3.2.4.16.25"/>
                                    <birthTime value="20110614"/>
                                    <gPPractice classCode="SDLOC">
                                        <addr>
                                            <postalCode>KT10 0EH</postalCode>
                                            <streetAddressLine>ELM ROAD</streetAddressLine>
                                            <streetAddressLine>CLAYGATE</streetAddressLine>
                                            <streetAddressLine/>
                                            <streetAddressLine>ESHER</streetAddressLine>
                                            <streetAddressLine>SURREY</streetAddressLine>
                                        </addr>
                                        <telecom use="WP" value="tel:01372462501"/>
                                        <locationOrganization classCode="ORG" determinerCode="INSTANCE">
                                            <id extension="H81109" root="2.16.840.1.113883.2.1.3.2.4.19.2"/>
                                            <name>CAPELFIELD SURGERY</name>
                                        </locationOrganization>
                                    </gPPractice>
                                </patientPerson>
                            </patient>
                        </subject>
                    </getPatientDetailsResponse-v1-0>
                </itk:payload>
            </itk:payloads>
        </itk:DistributionEnvelope>
    </soap:Body>
</soap:Envelope>